app/controllers/comments_controller.rb

  def create
    # This method needs some love...
    #
    # Here are some options: can we move this logic into a model somewhere.
    # Like:
    #
    # Comment.create_for_post(some_parent)
    #
    params[:comment][:user_id] = session[:user_id] #changing the inputs is a smell to me...
    post = Post.find(params[:post_id])
    params[:comment][:post_id] = post.id
    if params[:comment][:parent_id].to_i > 0
      parent = Comment.find_by_id(params[:comment].delete(:parent_id))
      @comment = parent.children.build(comment_params)
    else
      @comment = Comment.new(comment_params)
    end

    if @comment.save
---
SELECT  "comments".* FROM "comments"  WHERE "comments"."id" = 15 LIMIT 1
SELECT  "posts".* FROM "posts"  WHERE "posts"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "comments".* FROM "comments"  WHERE "comments"."parent_id" = $1  ORDER BY created_at DESC  [["parent_id", 5]]
INSERT INTO "comments" ("content", "created_at", "parent_id", "post_id", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["content", "asdsad"], ["created_at", "2015-01-18 19:34:30.421434"], ["parent_id", 15], ["post_id", 2], ["updated_at", "2015-01-18 19:34:30.421434"], ["user_id", 1]]

  def edit
    if session[:user_id]
      @comment = Comment.find(params[:id])
---
SELECT  "comments".* FROM "comments"  WHERE "comments"."id" = $1 LIMIT 1  [["id", 11]]

  def upvote
    if session[:user_id]
      @comment = Comment.find(params[:id])
---
SELECT  "comments".* FROM "comments"  WHERE "comments"."id" = $1 LIMIT 1  [["id", 15]]

  def downvote
    if session[:user_id]
      @comment = Comment.find(params[:id])
---
SELECT  "comments".* FROM "comments"  WHERE "comments"."id" = $1 LIMIT 1  [["id", 15]]