app/controllers/posts_controller.rb

SELECT  "users".* FROM "users"  WHERE "users"."id" = $1 LIMIT 1  [["id", 4]]
INSERT INTO "posts" ("address", "content", "created_at", "title", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["address", "idk"], ["content", "A lot of stuff"], ["created_at", "2015-01-17 23:37:26.013779"], ["title", "Open Kitchen"], ["updated_at", "2015-01-17 23:37:26.013779"], ["user_id", 4]]
---
  def create
    user = User.find(session[:user_id])
    @post = user.posts.new(post_params)
    if @post.save

SELECT  "posts".* FROM "posts"  WHERE "posts"."id" = $1 LIMIT 1  [["id", 1]]
---
  def edit
    if session[:user_id]
      @post = Post.find(params[:id])

SELECT  "posts".* FROM "posts"  WHERE "posts"."id" = $1 LIMIT 1  [["id", 2]]
UPDATE "posts" SET "updated_at" = $1 WHERE "posts"."id" = 2  [["updated_at", "2015-01-18 20:41:36.849331"]]
---
  def update
    post = Post.find(params[:id])
    if post.update(post_params)

SELECT  "posts".* FROM "posts"  WHERE "posts"."id" = $1 LIMIT 1  [["id", 1]]
---
  def upvote
    # Sometimes you can write an implementation, but not express the meaning.
    # I would much prefer to see `if current_user`.  Reason being thinking
    # about sessions and keys makes my brain hurt and I don't understand what
    # you _intention_ is.  Sometimes you take pieces of implementation and wrap
    # them in an English-friendly name so that your collaborators can
    # understand your _intention_.
    if session[:user_id]
      @post = Post.find(params[:id])

SELECT  "posts".* FROM "posts"  WHERE "posts"."id" = $1 LIMIT 1  [["id", 1]]
---
  def downvote
    if session[:user_id]
      @post = Post.find(params[:id])

SELECT "tags".* FROM "tags"  WHERE (LOWER(name) = LOWER('mexican'))
---
  def tagged
    if params[:tag].present?