app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users"  WHERE "users"."user_name" IS NULL LIMIT 1
---
  def create
    @user = User.find_by(user_name: params[:session][:user_name])